       IDENTIFICATION DIVISION.
       PROGRAM-ID. CobMerge.

       PROCEDURE DIVISION.
           DISPLAY "CobMerge v0.0.1".
           STOP RUN.

       END PROGRAM CobMerge.
